In [3]:
import pandas as pd
import numpy as np
# Create a sample DataFrame
data = {'Name': ['John', 'Emily', 'Tom', 'Lisa'],
        'Age': [25, 28, 22, 30],
        'City': ['New York', 'London', 'Paris', 'Tokyo']}
df = pd.DataFrame(data)

In [6]:
df.head(2)

    Name  Age      City
0   John   25  New York
1  Emily   28    London

In [7]:
# Select a single row using label-based indexing
row = df.loc[1]  # Selects the row with label/index 1 (Emily)
print(row)

Name     Emily
Age         28
City    London
Name: 1, dtype: object

In [8]:
# Select a subset of rows and specific columns
subset = df.loc[1:3, ['Name', 'City']]  # Selects rows 1 to 3 and columns 'Name' and 'City'
print(subset)

    Name    City
1  Emily  London
2    Tom   Paris
3   Lisa   Tokyo

In [10]:
transpose_df = df.T

In [12]:
transpose_df.loc['']

             0       1      2      3
Name      John   Emily    Tom   Lisa
Age         25      28     22     30
City  New York  London  Paris  Tokyo

In [11]:
transpose_df.loc['Name']

0     John
1    Emily
2      Tom
3     Lisa
Name: Name, dtype: object

In [15]:
transpose_df.loc['Name']

0     John
1    Emily
2      Tom
3     Lisa
Name: Name, dtype: object

In [16]:
transpose_df.loc['Name', 3]

'Lisa'

In [18]:
print(type(transpose_df.loc['Name', 3]))

<class 'str'>

In [20]:
transpose_df.loc["City",3]

'Tokyo'

In [21]:
df

    Name  Age      City
0   John   25  New York
1  Emily   28    London
2    Tom   22     Paris
3   Lisa   30     Tokyo

In [22]:
df.loc[0,'Age']

25

In [23]:
df.loc[0:,:]

    Name  Age      City
0   John   25  New York
1  Emily   28    London
2    Tom   22     Paris
3   Lisa   30     Tokyo

In [25]:
df.head()

    Name  Age      City
0   John   25  New York
1  Emily   28    London
2    Tom   22     Paris
3   Lisa   30     Tokyo

In [24]:
# iloc practice

# Select a single row using integer-based indexing
row = df.iloc[1]  # Selects the row with index 1 (Emily)
print(row)

Name     Emily
Age         28
City    London
Name: 1, dtype: object

In [27]:
# Select a subset of rows and specific columns
subset = df.iloc[1:3, [0, 2]] 
# Selects rows 1 to 2 and columns at positions 0 and 2
print(subset)

    Name    City
1  Emily  London
2    Tom   Paris

#### Notice that with iloc, the row and column selections are based on integer positions and follow the Python indexing convention (starting from 0).